# テーブルを作成する  
## 方針
各チャブターのテーブルは
- 'chapXX.db'というDBに放り込む
- テーブル名は書籍に準ずる

In [1]:
import os
import sqlite3
import numpy as np
import pandas as pd

# chap7のDB作成

In [2]:
TestResults = pd.DataFrame(
    {
        'student_id':[str(e).zfill(3) for e in range(1,16)],
        'class':['A']*4 + ['B']*5 + ['C']*3 + ['D'] * 3,
        'sex':['male' if e == 1 else 'female' for e in [1,0,0,1,0,1,1,1,0,1,1,0,0,0,0]],
        'score':[100, 100, 49, 30, 100, 92, 80, 80, 10, 92, 80, 21, 100, 0, 0]
    }
)

In [3]:
TestResults

   student_id class     sex  score
0         001     A    male    100
1         002     A  female    100
2         003     A  female     49
3         004     A    male     30
4         005     B  female    100
5         006     B    male     92
6         007     B    male     80
7         008     B    male     80
8         009     B  female     10
9         010     C    male     92
10        011     C    male     80
11        012     C  female     21
12        013     D  female    100
13        014     D  female      0
14        015     D  female      0

In [6]:
# create database(if not exist)

# filename
folder = '../dataset/'
dbname = 'chap07.db'

# make connection to the db
conn = sqlite3.connect(folder + dbname)

# make cursor object for opearating sqlite
cur = conn.cursor()

# create table TestResults
TestResults.to_sql('TestResults', conn, if_exists='replace')

# confirm table
select_sql = 'SELECT * FROM TestResults'
for row in cur.execute(select_sql):
    print(row)

cur.close()
conn.close()

(0, '001', 'A', 'male', 100)
(1, '002', 'A', 'female', 100)
(2, '003', 'A', 'female', 49)
(3, '004', 'A', 'male', 30)
(4, '005', 'B', 'female', 100)
(5, '006', 'B', 'male', 92)
(6, '007', 'B', 'male', 80)
(7, '008', 'B', 'male', 80)
(8, '009', 'B', 'female', 10)
(9, '010', 'C', 'male', 92)
(10, '011', 'C', 'male', 80)
(11, '012', 'C', 'female', 21)
(12, '013', 'D', 'female', 100)
(13, '014', 'D', 'female', 0)
(14, '015', 'D', 'female', 0)

## Teams

In [10]:
Teams = pd.DataFrame(
    {
        'member': ['Joe', 'Ken', 'Mik', 'Karen', 'Keith', 'Jan', 'Hart', 'Dick', 'Beth', 'Alen', 'Robert', 'Kagan'],
        'team_id': [1,1,1,2,2,3,3,3,4,5,5,5],
        'status':['ready', 'active', 'ready', 'active', 'absence', 'ready', 'ready', 'ready', 'ready', 'active', 'absence', 'ready'],
    }
)

In [11]:
Teams

    member  team_id   status
0      Joe        1    ready
1      Ken        1   active
2      Mik        1    ready
3    Karen        2   active
4    Keith        2  absence
5      Jan        3    ready
6     Hart        3    ready
7     Dick        3    ready
8     Beth        4    ready
9     Alen        5   active
10  Robert        5  absence
11   Kagan        5    ready

In [13]:
# create database(if not exist)

# filename
folder = '../dataset/'
dbname = 'chap07.db'

# make connection to the db
conn = sqlite3.connect(folder + dbname)

# make cursor object for opearating sqlite
cur = conn.cursor()

# create table TestResults
Teams.to_sql('Teams', conn, if_exists='replace')

# confirm table
select_sql = 'SELECT * FROM Teams'
for row in cur.execute(select_sql):
    print(row)

cur.close()
conn.close()

(0, 'Joe', 1, 'ready')
(1, 'Ken', 1, 'active')
(2, 'Mik', 1, 'ready')
(3, 'Karen', 2, 'active')
(4, 'Keith', 2, 'absence')
(5, 'Jan', 3, 'ready')
(6, 'Hart', 3, 'ready')
(7, 'Dick', 3, 'ready')
(8, 'Beth', 4, 'ready')
(9, 'Alen', 5, 'active')
(10, 'Robert', 5, 'absence')
(11, 'Kagan', 5, 'ready')